<?php
/* Copyright (C) 
* 2016 - dinghui@plu.cn
* This program is free software; you can redistribute it and/or
* modify it under the terms of the GNU General Public License
* as published by the Free Software Foundation; either version 2
* of the License, or (at your option) any later version.
* 
* This program is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
* GNU General Public License for more details.
* 
* You should have received a copy of the GNU General Public License
* along with this program; if not, write to the Free Software
* Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
* 
*/


//线下入职模板
$sheets[0] = [
	'name'  => '线下入职模板', 
	'title' => [
		["导入系统姓名", 74],
		["工号", 68],
		["hr姓名", 103],
		["入司时间", 116],
		["录用原因", 53],
		["录用原\n因代码", 42],
		["职位代码", 234],
		["职位名称", 365],
		["人事范围代码", 117],
		["人事范围", 156],
		["员工组", 117],
		["员工组代码", 91],
		["员工子组", 130],
		["员工子组编码", 74],
		["人事子范围", 63],
		["人事子范围编码", 86],
		["工资核算范围", 86],
		["工资核算范围编码", 113],
		["工资管理员", 105],
		["工资管理员编码", 99],
		["行政级别", 60],
		["专业级别", 60],
		["专业级别编码", 74],
		["体系", 38],
		["体系代码", 53],
		["品类编码", 53],
		["品类", 38],
		["兼品类备注", 63],
		["首次参加工作日期", 97],
		["曾用名", 42],
		["性别", 38],
		["男", 38],
		["女", 38],
		["出生日期", 67],
		["国籍", 38],
		["宗教", 38],
		["婚姻状况", 53],
		["身高", 38],
		["籍贯", 86],
		["该列不需填写。", 86],
		["户口所在地址", 323],
		["该列不需填写。", 86],
		["户口性质", 53],
		["最高学历编码", 74],
		["最高学历", 63],
		["身份证号码", 127],
		["该列不需填写", 74],
		["身份证号1", 68],
		["身份证号2", 68],
		["身份证号3", 68],
		["身份证号4", 68],
		["身份证号5", 68],
		["身份证签发机构", 109],
		["该列不需填写", 74],
		["民族", 38],
		["民族编码", 53],
		["人员类别", 68],
		["人员类别编码", 74],
		["政治面貌", 86],
		["政治面貌编码", 86],
		["入司前社保缴费", 100],
		["外派类型", 81],
		["住房补贴类型", 86],
		["特长", 68],
		["该列不需填写", 86],
		["班别", 80],
		["工作时间规则", 108],
		["工作时间规则代码", 113],
		["时间管理状态", 86],
		["考勤卡号", 86],
		["联系电话（公司）", 97],
		["联系电话（个人）", 97],
		["子女数目", 60],
		["合同类型", 68],
		["合同类型名称", 86],
		["有效截止日期", 86],
		["试用期", 47],
		["合同种类", 53],
		["合同种类名称", 86],
		["合同签订地", 72],
		["合同签订地公司名称", 156],
		["门店代码", 60],
		["备注", 41],
		["豆芽账号", 63]
	],
	'rule' => [
		['C2', 'A'],	
		['C2', 'C'],	
		['I8', 'AC'],	
		['E2', 'AE'],	
		['E2', 'AE'],	
		['E3', 'AH'],	
		['E4', 'AI'],	
		['G3', 'AK'],	
		['C4', 'AL'],	
		['G6', 'AM'],	
		['C15', 'AO'],	
		['G5', 'AQ'],
		['E5', 'AS'],
		['C6', 'AT'],
		['G2', 'BC'],
		['HA', 'BD'],
		['I2', 'BG'],
		['C11', 'BT'],
		['I4', 'BU'],
	]
];

//个人数据
$sheets[1] = [
	'name'  => '个人数据', 
	'title' => [
		["序号", 33],
		["工号", 41],
		["姓名", 103],
		["姓名（修改后）", 92],
		["性别", 33],
		["出生日期", 56],
		["婚姻状况", 56],
		["生育状况", 56],
		["子女数目", 81],
		["国籍", 33],
		["籍贯", 33],
		["最高学历",56]
	],
	'rule' => [
		['C2' ,'C'],
		['G4' ,'H'],
		['I4' ,'I'],
	]
];

// ZINS0105通讯
$sheets[2] = [
	'name'  => 'ZINS0105通讯', 
	'title' => [
		["序号", 33],
		["工号", 41],
		["姓名", 103],
		["开始日期", 67],
		["通讯类型", 145],
		["电话号码", 114],
		["备注", 39]
	],
	'rule' => [
		['C2'  ,'C'],
		['G11' ,'F'],
	]	
];

//ZINS0006_NEW地址
$sheets[3] = [
	'name'  => 'ZINS0006_NEW地址',
	'title' => [
		["序号", 35],
		["地址类型（必填）", 67],
		["工号", 41],
		["姓名", 103],
		["开始时间", 67],
		["结束时间", 67],
		["邮政编码", 56],
		["城市（详细地址）", 323],
		["国家代码", 56],
		["是否通讯地址", 80],
		["地区", 33],
		["城市", 33],
		["详细地址（香港地区填写）", 253],
		["户口性质（户口地址必须填写）", 180],
		["备注", 82],
	],
	'rule' => [
		[ ['B15','B'], ['C2', 'D'], ['C15','H'] ],
		[ ['B16','B'], ['C2', 'D'], ['C16','H'] ],
		[ ['B17','B'], ['C2', 'D'], ['C17','H'] ],
		[ ['B18','B'], ['C2', 'D'], ['C18','H'] ],
	],
];

// ZINS0021家庭成员、相关人员
$sheets[4] = [
	'name'  => 'ZINS0021家庭成员、相关人员',
	'title' => [
		["序号", 33],
		["工号",41],
		["姓名", 103],
		["开始日期", 69],
		["结束日期", 72],
		["*与本人关系", 74],
		["*家庭成员姓名", 87],
		["*出生日期", 79],
		["工作/学习单位", 180],
		["职务", 67],
		["备注", 74]
	], 
	'rule' => [
		['C2' , 'C'],
		['B20', 'F'],
		['C20', 'G'],
		['D20', 'H'],
		['E20', 'I'],
		['H20', 'J'],
	],
];

// ZINS9010教育
$sheets[5] = [
	'name'  => 'ZINS9010教育',
	'title' => [
		["序号", 33],
		["工号", 41],
		["姓名", 103],
		["开始日期", 72],
		["结束日期", 79],
		["证明人", 45],
		["证明人电话", 67],
		["学历", 88],
		["学校", 193],
		["教育类型", 68],
		["学科1", 92],
		["专业类别1", 125],
		["专业1", 137],
		["学科2", 39],
		["专业类别2", 62],
		["专业2", 72],
		["其他专业", 56],
		["学位证书", 63],
		["是否最高学历", 80],
		["在校任职情况", 80],
		["在校获奖情况", 80],
		["其他", 33],
		["任职职务", 56],
		["任职内容", 56],
		["备注", 70]
	],
	'rule' => [
		['C2'  ,'C'],
		['E5'  ,'H'],
		['E32' ,'I'],
		['I32' ,'J'],
		['G32' ,'L'],
	],
];

// ZINS0023其他 先前雇主 
$sheets[6] = [
	'name' => 'ZINS0023其他 先前雇主',
	'title' => [
		["序号", 33],
		["工号*", 46],
		["姓名*", 103],
		["入职", 67],
		["开始日期*", 67],
		["结束日期*", 67],
		["雇主*", 596],
		["城市*", 63],
		["行业*", 39],
		["证明人", 63],
		["证明人电话", 92],
		["任职职务*", 62],
		["任职内容*", 62],
		["工作中取得成果", 92],
		["离职原因", 56],
		["备注", 39]
	],
	'rule' => [
		[ ['C2','C'], ['D35','G'], ['F35', 'H'], ['G35', 'I'], ['H35', 'L'], ['I35', 'M']],
		[ ['C2','C'], ['D36','G'], ['F36', 'H'], ['G36', 'I'], ['H36', 'L'], ['I36', 'M']],
		[ ['C2','C'], ['D37','G'], ['F37', 'H'], ['G37', 'I'], ['H37', 'L'], ['I37', 'M']],
	],
];

// ZINS0016合同要素
$sheets[7] = [
	'name' => 'ZINS0016合同要素',
	'title' => [
		["序号", 33],
		["工号", 41],
		["姓名", 103],
		["开始日期", 67],
		["合同类型", 56],
		["有效截止日期", 80],
		["试用期", 45],
		["单位", 33],
		["合同种类", 115],
		["合同标识", 56],
		["合同签订地", 67],
		["备注", 33],
		["金额", 33],
		["备注", 39]
	],
	'rule' => [],
];
